       01  WS-API-PARAMETERS.
           05  WS-API-RULE-IN     PIC X(1) VALUE SPACES.
           05  WS-API-RESP-OUT    PIC X(30) VALUE 'NULL'.
       
           