//IBMUSERB JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//*
//* debug mode disabled for demo
//DEMO     EXEC PGM=ASAMPLE 
//*DEMODBG  EXEC PGM=ASAMPLE,PARM='1/TEST(ALL,,,RDS:*)'
//*STEPLIB  DD  DISP=SHR,DSN=IBMUSER.IDZ.LOAD     IDZ builds
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD  VSCode builds
//*STEPLIB  DD  DISP=SHR,DSN=ZDEV.DEV.LOAD        Wazi Deploy Dev rel
//*STEPLIB  DD  DISP=SHR,DSN=ZDEV.QA.LOAD         Wazi Deploy QA rel
//SYSOUT   DD SYSOUT=*
