//IBMUSERA JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//RULE1     EXEC PGM=DATBATCH,PARM='1'
//STEPLIB   DD DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSOUT    DD SYSOUT=* 
//
//RULE2     EXEC PGM=DATBATCH,PARM='2'
//STEPLIB   DD DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSOUT    DD SYSOUT=*
//RULEX     EXEC PGM=DATBATCH,PARM='x'
//STEPLIB   DD DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSOUT    DD SYSOUT=*