//IBMUSERB JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//JOBLIB  DD DISP=SHR,DSN=DB2V13.SDSNLOAD
//        DD DISP=SHR,DSN=CEE.SCEERUN
//*  
//RUN  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM(DBD1)
  RUN PROGRAM(DB2PGMP) PLAN(DB2PGMP) LIB('ZDEV.DEV.LOAD')
END 

