//IBMUSERA JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//* tEST A SAMPLE PLI PGM 
//*  
//** 
//RULE1     EXEC PGM=HELLO 
//STEPLIB   DD DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSPRINT  DD SYSOUT=*
