PROC 2 DBRMLIB PGMNAME
CONTROL LIST MSG

WRITE dbb$bind - Started v1c (Nlopez) 
WRITE Input ARGS: DBRMLIB=&DBRMLIB PGMNAME=&PGMNAME
 
ALLOC FILE(DBRMLIB) DA('&DBRMLIB') SHR REUSE

DSN SYSTEM(DBD1)
 BIND PACKAGE (&PGMNAME) MEMBER(&PGMNAME) ACT(REP) ISO(CS)  
END

SET BCC = &LASTCC

WRITE  dbb$bind - Started v1a  BIND RC = &BCC

free FILE(DBRMLIB) 
EXIT CODE(&BCC)