       ID DIVISION.                            
       PROGRAM-ID. ASAMP2.                     
       ENVIRONMENT DIVISION.                   
       DATA DIVISION.                          
       WORKING-STORAGE SECTION.                
       COPY DATVARS.                           
       PROCEDURE DIVISION.                     
           DISPLAY 'Demo build overrides'. 
           STOP RUN.                           